**Q1. List any five functions of the pandas library with execution.**

In [1]:
import pandas as pd

# Creating multiple Series
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 35])

# Creating a DataFrame using the Series
data = {'Name': names, 'Age': ages}
df = pd.DataFrame(data)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [2]:
   print(df.head())

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [3]:
   df.dropna(inplace=True)

In [4]:
   grouped_data = df.groupby('Name')

In [5]:
df.tail()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [6]:
df.isna()

    Name    Age
0  False  False
1  False  False
2  False  False

**Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.**

In [7]:
import pandas as pd

def reindex_dataframe(df):
    new_index = pd.Series(range(1, 2*len(df)+1, 2))
    df = df.reset_index(drop=True)
    df.index = new_index
    return df

In [8]:
reindex_dataframe(df)

      Name  Age
1    Alice   25
3      Bob   30
5  Charlie   35

**Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.**

In [9]:
def calculate_sum_of_first_three(df):
    sum_of_first_three = df['Values'].iloc[:3].sum()
    print("Sum of the first three values:", sum_of_first_three)

In [12]:
data = {
    'name': ['john','Sane','Ampo','hetra','Sanatta'],
    'Values':[10, 20, 30, 40, 50]
}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

      name  Values
0     john      10
1     Sane      20
2     Ampo      30
3    hetra      40
4  Sanatta      50

In [15]:
calculate_sum_of_first_three(df)

Sum of the first three values: 60

**Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.**

In [25]:
def add_word_count_column(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))
    return df

In [33]:
data = {
    'name': ['john','Sane','Ampo','hetra','Sanatta'],
    'Values':[10, 20, 30, 40, 50],
    'Text':['Hellloo i am ', 'Fine you are', 'Lol how', 'Yahooo no you can','Weldone']
}

In [34]:
df = pd.DataFrame(data)

In [35]:
df

      name  Values               Text
0     john      10      Hellloo i am
1     Sane      20       Fine you are
2     Ampo      30            Lol how
3    hetra      40  Yahooo no you can
4  Sanatta      50            Weldone

In [36]:
add_word_count_column(df)

      name  Values               Text  Word_Count
0     john      10      Hellloo i am            3
1     Sane      20       Fine you are           3
2     Ampo      30            Lol how           2
3    hetra      40  Yahooo no you can           4
4  Sanatta      50            Weldone           1

**Q5. How are DataFrame.size() and DataFrame.shape() different?**

- DataFrame.size returns the number of elements in the DataFrame, which is equivalent to the number of rows multiplied by the number of columns.
- DataFrame.shape returns a tuple representing the dimensions of the DataFrame, in the form (number of rows, number of columns).

In [38]:
df.shape

(5, 4)

In [39]:
df.size

20

**Q6. Which function of pandas do we use to read an excel file?**

The function used to read an Excel file in pandas is pd.read_excel(). This function can be used to read data from an Excel file into a pandas DataFrame.

**Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.**

In [40]:
def extract_username(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

**Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.**

In [41]:
data = {
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
}

In [42]:
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [50]:
def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

In [52]:
select_rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

**Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.**

In [53]:
data = {
    'name': ['john','Sane','Ampo','hetra','Sanatta'],
    'Values':[10, 20, 30, 40, 50],
    'Text':['Hellloo i am ', 'Fine you are', 'Lol how', 'Yahooo no you can','Weldone']
}

In [54]:
df = pd.DataFrame(data)

In [58]:
def stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    standard_deviation = df['Values'].std()
    return mean, median, standard_deviation

In [59]:
stats(df)

(30.0, 30.0, 15.811388300841896)

**Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.**

In [60]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

```Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:```

```Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.```

In [61]:
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df